# SecondaryHandrailHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RailingType..::..SecondaryHandrailHeight Property
RailingType Class See Also
---
The height of the secondary handrail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double SecondaryHandrailHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SecondaryHandrailHeight As Double
	Get
```

Visual C++
---
```text
public:
property double SecondaryHandrailHeight {
	double get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The rail has no secondary hand rail. |

# See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace